# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics RT-DETR-x hybrid object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/rtdetr
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  x: [1.00, 1.00, 2048]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 64]] # 0-P2/4
  - [-1, 6, HGBlock, [64, 128, 3]] # stage 1

  - [-1, 1, DWConv, [128, 3, 2, 1, False]] # 2-P3/8
  - [-1, 6, HGBlock, [128, 512, 3]]
  - [-1, 6, HGBlock, [128, 512, 3, False, True]] # 4-stage 2

  - [-1, 1, DWConv, [512, 3, 2, 1, False]] # 5-P3/16
  - [-1, 6, HGBlock, [256, 1024, 5, True, False]] # cm, c2, k, light, shortcut
  - [-1, 6, HGBlock, [256, 1024, 5, True, True]]
  - [-1, 6, HGBlock, [256, 1024, 5, True, True]]
  - [-1, 6, HGBlock, [256, 1024, 5, True, True]]
  - [-1, 6, HGBlock, [256, 1024, 5, True, True]] # 10-stage 3

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]] # 11-P4/32
  - [-1, 6, HGBlock, [512, 2048, 5, True, False]]
  - [-1, 6, HGBlock, [512, 2048, 5, True, True]] # 13-stage 4

head:
  - [-1, 1, Positioning, []]  # 14
  - [-1, 1, Conv, [384, 1, 1, None, 1, 1, False]] # 15 input_proj.2
  - [-1, 1, AIFI, [2048, 8]]  #16
  - [-1, 1, Conv, [384, 1, 1]] # 17, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18
  - [10, 1, Conv, [768, 3, 2]] # 19 input_proj.1
  - [[-1,-2], 1, Focusing, []] # 20
  - [-1, 1, Conv, [384, 1, 1]] # 21, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #22
  - [4, 1, Conv, [768, 3, 2]] # 23 input_proj.0
  - [[-1,-2], 1, Focusing, []] #24

  - [-1, 1, Conv, [384, 3, 2]] # 25, downsample_convs.0
  - [[-1, 21], 1, Concat, [1]] # 26 cat Y4
  - [-1, 3, RepC3, [384]] # 27 F4 (28), pan_blocks.0

  - [-1, 1, Conv, [384, 3, 2]] # 28, downsample_convs.1
  - [[-1, 16], 1, Concat, [1]] # 29 cat Y5
  - [-1, 3, RepC3, [384]] # 30 F5 (31), pan_blocks.1

  - [[24, 27, 30], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
