
# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv5 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov5
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov5n.yaml' will call yolov5.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]                          input  【3，256，256】
  - [-1, 1, Conv, [64, 6, 2, 2]] # 0-P1/2                 0      【32，128，128】
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4                   1      【64，64，64】
  - [-1, 3, C3, [128]] #                                  2      【64，64，64】
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8                   3      【128，32，32】
  - [-1, 6, C3, [256]]                      #             4       [128,32,32]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16                  5       [256,16,16]
  - [-1, 9, C3, [512]]                  #                 6       [256,16,16]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32                 7       [512,8,8]
  - [-1, 3, C3, [1024]]      #                            8       [512,8,8]
  - [-1, 1, SPPF, [1024, 5]] # 9                          9       [512,8,8]

# YOLOv5 v6.0 head
head:
  - [-1, 1, Positioning, []]         #                    10    [512,8,8]
#  - [-1, 1, Conv, [512, 1, 1]] #11                              [256,8,8]
#  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  #               [256,16,16]
#  - [[-1, 6], 1, Concat, [1]] # cat backbone P4                 [512,16,16]
#  - [-1, 3, C3, [512, False]] # 13                              [256,16,16]
  - [[-1,6], 1, Focusing, []]  #                          11     [256,16,16]

#  - [-1, 1, Conv, [256, 1, 1]] #                                [128,16,16]
#  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  #               [128,32,32]
#  - [[-1, 4], 1, Concat, [1]] # cat backbone P3                 [256,32,32]
#  - [-1, 3, C3, [256, False]] # 17 (P3/8-small)                 [128,32,32]
  - [[-1,4], 1, Focusing, []] #                          12      [128,32,32]

  - [-1, 1, Conv, [256, 3, 2]] #                         13     [128,16,16]
  - [[-1, 11], 1, Concat, [1]] # cat head P4             14     [256,16,16]
  - [-1, 3, C3, [512, False]] # 20 (P4/16-medium)        15     [256,16,16]

  - [-1, 1, Conv, [512, 3, 2]] #                         16     [256,8,8]
  - [[-1, 10], 1, Concat, [1]] # cat head P5             17     [512,8,8]
  - [-1, 3, C3, [1024, False]] # 23 (P5/32-large)        18     [512,8,8]

  - [[12, 15, 18], 1, Detect, [nc]] # Detect(P3, P4, P5)
